#2. Напишите программу для проверки истинности утверждения
# ¬(X ⋁ Y ⋁ Z) = ¬X ⋀ ¬Y ⋀ ¬Z для всех значений предикат.

print("Выражение ¬(X ⋁ Y ⋁ Z) = ¬X ⋀ ¬Y ⋀ ¬Z истинно при следующих значениях предикат:\n")
print ('------------------')
print('| x | y | z ||res|')
print ('------------------')
for x in range(2):
    for y in range (2):
        for z in range (2):
            if not(x or y or z) == ((not x) and (not y) and (not z)):
                print ('|', x,'|', y, '|', z,'||', '1','|')
                print ('------------------')