# 2. Напишите программу, которая принимает на вход число N и выдает набор произведений чисел от 1 до N.
# 1 - 1 * 1, 2 - 1 * 2, 3 - 1 * 2 * 3, 4 - 1 * 2 * 3 * 4 и т.д.
# - 4 -> [1, 2, 6, 24]
# - 6 -> [1, 2, 6, 24, 120, 720]

print ('Введите число N, и я покажу набор факториалов от 1 до N')
N = int(input('Введите число:\n'))
list_numbers = []
temp = 1
for i in range (1,N+1):
    for k in range (1, i+1):
        temp*=k
    list_numbers.append(temp)
    temp = 1
print (list_numbers)